---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerInternalException
source: html/6dcd093c-d643-07cd-535f-36ffa9d2db52.htm
---
# Autodesk.Revit.Exceptions.RevitServerInternalException

The exception that is thrown when there is any server internal error happening.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerInternalException : RevitServerException
```